### Libraries

In [4]:
# Importing pandas with an alias
import pandas as pd

### Loading data

In [9]:
# Importing and mapping "accesses" workspace in the xlsx archive
accesses = pd.read_excel('accesses_and_purchases.xlsx', sheet_name='accesses')
accesses

   user_id user_name  total
0        8     RENAN     10
1        3  GABRIELA      2
2        5    REBECA    399
3        6     PEDRO     21
4        7     JAMES      1

In [10]:
# Importing and mapping "purchases" workspace in the xlsx archive
purchases = pd.read_excel('accesses_and_purchases.xlsx', sheet_name='purchases')
purchases

   user_id user_name  total
0        2      JOÃO     78
1        3  GABRIELA    100
2        5    REBECA     22
3        6     PEDRO    332
4        1   MARIANA     13

### merge() with intersections

#### SQL JOIN: Users who have accesses and purchases, bringing information from both tables

In [12]:
# INNERJOIN = TABLE1.merge(TABLE2, how = 'INNER, LEFT, RIGHT, OUTER', on = 'TABLE_ID')
inner_join = accesses.merge(purchases, how = 'inner', on = 'user_id')
inner_join

   user_id user_name_x  total_x user_name_y  total_y
0        3    GABRIELA        2    GABRIELA      100
1        5      REBECA      399      REBECA       22
2        6       PEDRO       21       PEDRO      332

#### SQL LEFT JOIN: Users who have accesses but bringing also total purchases, if they have

In [13]:
# LEFTJOIN = TABLE1.merge(TABLE2, how = 'INNER, LEFT, RIGHT, OUTER', on = 'TABLE_ID')
left_join = accesses.merge(purchases, how='left', on='user_id')
left_join

   user_id user_name_x  total_x user_name_y  total_y
0        8       RENAN       10         NaN      NaN
1        3    GABRIELA        2    GABRIELA    100.0
2        5      REBECA      399      REBECA     22.0
3        6       PEDRO       21       PEDRO    332.0
4        7       JAMES        1         NaN      NaN

#### SQL RIGHT JOIN: Users who have purchases but bringing also total accesses, if they have

In [38]:
# RIGHTJOIN = TABLE1.merge(TABLE2, how = 'INNER, LEFT, RIGHT, OUTER', on = 'TABLE_ID')
right_join = accesses.merge(purchases, how='right', on='user_id')
right_join

   user_id user_name_x  total_x user_name_y  total_y
0        2         NaN      NaN        JOÃO       78
1        3    GABRIELA      2.0    GABRIELA      100
2        5      REBECA    399.0      REBECA       22
3        6       PEDRO     21.0       PEDRO      332
4        1         NaN      NaN     MARIANA       13

#### SQL FULL JOIN: Users who have accesses or purchases, bringing both information, if it exist

In [37]:
# FULLJOIN = TABLE1.merge(TABLE2, how = 'INNER, LEFT, RIGHT, OUTER', on = 'TABLE_ID')
full_join = accesses.merge(purchases, how='outer', on='user_id')
full_join

   user_id user_name_x  total_x user_name_y  total_y
0        1         NaN      NaN     MARIANA     13.0
1        2         NaN      NaN        JOÃO     78.0
2        3    GABRIELA      2.0    GABRIELA    100.0
3        5      REBECA    399.0      REBECA     22.0
4        6       PEDRO     21.0       PEDRO    332.0
5        7       JAMES      1.0         NaN      NaN
6        8       RENAN     10.0         NaN      NaN

### merge() without intersections

#### SQL LEFT JOIN: Users who have accesses but don't have purchases

In [30]:
# LEFTJOIN = TABLE1.merge(TABLE2, how = 'INNER, LEFT, RIGHT, OUTER', on = 'TABLE_ID')
left_join = accesses.merge(purchases, how='left', on='user_id', indicator=True)
left_join

   user_id user_name_x  total_x user_name_y  total_y     _merge
0        8       RENAN       10         NaN      NaN  left_only
1        3    GABRIELA        2    GABRIELA    100.0       both
2        5      REBECA      399      REBECA     22.0       both
3        6       PEDRO       21       PEDRO    332.0       both
4        7       JAMES        1         NaN      NaN  left_only

In [41]:
# Filtering the "_merge" collumn
left_join = left_join[left_join._merge == 'left_only']
left_join

   user_id user_name_x  total_x user_name_y  total_y     _merge
0        8       RENAN       10         NaN      NaN  left_only
4        7       JAMES        1         NaN      NaN  left_only

#### SQL RIGHT JOIN: Users who have purchases but dont have accesses

In [39]:
# RIGHTJOIN = TABLE1.merge(TABLE2, how = 'INNER, LEFT, RIGHT, OUTER', on = 'TABLE_ID')
right_join = accesses.merge(purchases, how='right', on='user_id', indicator = True)
right_join

   user_id user_name_x  total_x user_name_y  total_y      _merge
0        2         NaN      NaN        JOÃO       78  right_only
1        3    GABRIELA      2.0    GABRIELA      100        both
2        5      REBECA    399.0      REBECA       22        both
3        6       PEDRO     21.0       PEDRO      332        both
4        1         NaN      NaN     MARIANA       13  right_only

In [42]:
# Filtering the "_merge" collumn
right_join = right_join[right_join._merge == 'right_only']
right_join

   user_id user_name_x  total_x user_name_y  total_y      _merge
0        2         NaN      NaN        JOÃO       78  right_only
4        1         NaN      NaN     MARIANA       13  right_only

#### SQL FULL JOIN: Users who have accesses or purchases, but dont have both at sametime

In [40]:
# FULLJOIN = TABLE1.merge(TABLE2, how = 'INNER, LEFT, RIGHT, OUTER', on = 'TABLE_ID')
full_join = accesses.merge(purchases, how='outer', on='user_id', indicator = True)
full_join

   user_id user_name_x  total_x user_name_y  total_y      _merge
0        1         NaN      NaN     MARIANA     13.0  right_only
1        2         NaN      NaN        JOÃO     78.0  right_only
2        3    GABRIELA      2.0    GABRIELA    100.0        both
3        5      REBECA    399.0      REBECA     22.0        both
4        6       PEDRO     21.0       PEDRO    332.0        both
5        7       JAMES      1.0         NaN      NaN   left_only
6        8       RENAN     10.0         NaN      NaN   left_only

In [43]:
# Filtering the "_merge" collumn
full_join = full_join[full_join._merge != 'both']
full_join

   user_id user_name_x  total_x user_name_y  total_y      _merge
0        1         NaN      NaN     MARIANA     13.0  right_only
1        2         NaN      NaN        JOÃO     78.0  right_only
5        7       JAMES      1.0         NaN      NaN   left_only
6        8       RENAN     10.0         NaN      NaN   left_only